In [1]:
import pandas as pd
import sqlite3

# creating connection to database
conn = sqlite3.connect("../datasets/database.sqlite")

# fetching actual tables in database and 
# tables [reviews,artists,genres,labels,years,content]
#  WHERE type='table' AND name NOT LIKE 'sqlite_%'
tables = pd.read_sql(
    "SELECT name FROM sqlite_master", conn)
tables

      name
0  reviews
1  artists
2   genres
3   labels
4    years
5  content

In [2]:
#  case statement by condition expression
years = pd.read_sql(
    'SELECT reviewid, IFNULL(year,0), CASE WHEN year < 2010 THEN "the year less than 2010" ELSE "the year more than 2010" END AS yeartext FROM years', conn)
#  select *, CASE WHEN year > 2010 THEN "the year is above 2010" ELSE "the year below 2010" END AS yeartext from years
# fetching years column without null
years_without_null = pd.read_sql('SELECT * FROM years WHERE year IS NOT NULL', conn)

# fecthing DISTINCT(different values only) years 
distinct_years = pd.read_sql('SELECT DISTINCT year FROM years', conn)
years

       reviewid  IFNULL(year,0)                 yeartext
0         22703            1998  the year less than 2010
1         22721            2016  the year more than 2010
2         22659            2016  the year more than 2010
3         22661            2016  the year more than 2010
4         22725            2016  the year more than 2010
...         ...             ...                      ...
19103      1535               0  the year more than 2010
19104      1341               0  the year more than 2010
19105      5376               0  the year more than 2010
19106      2413            1999  the year less than 2010
19107      3723               0  the year more than 2010

[19108 rows x 3 columns]

In [3]:
#  ordering by year ascending(ASC)
asc_years = pd.read_sql('SELECT * FROM years WHERE year IS NOT NULL ORDER BY year', conn)

# using aggregate function COUNT and null function
years_count = pd.read_sql('SELECT COUNT(year), IFNULL(year,0000) FROM years GROUP BY year', conn)

In [4]:
# fetching reviews and artists using INNER JOIN table by conn
reviews = pd.read_sql("SELECT * FROM reviews INNER JOIN artists WHERE reviews.reviewid LIMIT '10'", conn)

# fetching 5 last rows as first index rows with asc
last_five_rows_of_years = pd.read_sql('SELECT * FROM (SELECT * FROM years ORDER BY reviewid DESC LIMIT 5) ORDER BY reviewid ASC', conn)
last_five_rows_of_years

   reviewid  year
0     22721  2016
1     22722  2016
2     22724  2016
3     22725  2016
4     22745  2016